{
  "irVersion": "0.1",
  "execution_id": "29db3d5a-b0c3-4aee-bdab-333ccba83864",
  "language_id": "cpp",
  "events": [
    {
      "irVersion": "0.1",
      "sequence": 1,
      "type": "execution.started",
      "source": {
        "line": 1
      },
      "entityId": null,
      "payload": {}
    },
    {
      "irVersion": "0.1",
      "sequence": 2,
      "type": "scope.entered",
      "source": {
        "line": 1
      },
      "entityId": null,
      "payload": {
        "scopeId": "scope_main_1",
        "displayName": "main"
      }
    },
    {
      "irVersion": "0.1",
      "sequence": 3,
      "type": "entity.created",
      "source": {
        "line": 2
      },
      "entityId": "var_x_1",
      "payload": {
        "kind": "variable",
        "displayName": "x",
        "dataType": "int",
        "value": 10,
        "scopeId": "scope_main_1"
      }
    },
    {
      "irVersion": "0.1",
      "sequence": 4,
      "type": "scope.exited",
      "source": {
        "line": 4
      },
      "entityId": null,
      "payload": {
        "scopeId": "scope_main_1",
        "displayName": "main"
      }
    },
    {
      "irVersion": "0.1",
      "sequence": 5,
      "type": "execution.completed",
      "source": {
        "line": 4
      },
      "entityId": null,
      "payload": {}
    }
  ]
}
